mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2h4xe/common/s6e2h4xe.h
/*******************************************************************************
* CAN Registers CAN1
*   Register Definition
*******************************************************************************/
#define FM_CAN1_CTRLR                             *((volatile uint16_t*)(0x40063000UL))
#define FM4_CAN1_CTRLR                            *((volatile uint16_t*)(0x40063000UL))
#define FM_CAN1_STATR                             *((volatile uint16_t*)(0x40063002UL))
#define FM4_CAN1_STATR                            *((volatile uint16_t*)(0x40063002UL))
#define FM_CAN1_ERRCNT                            *((volatile uint16_t*)(0x40063004UL))
#define FM4_CAN1_ERRCNT                           *((volatile uint16_t*)(0x40063004UL))
#define FM_CAN1_BTR                               *((volatile uint16_t*)(0x40063006UL))
#define FM4_CAN1_BTR                              *((volatile uint16_t*)(0x40063006UL))
#define FM_CAN1_INTR                              *((volatile uint16_t*)(0x40063008UL))
#define FM4_CAN1_INTR                             *((volatile uint16_t*)(0x40063008UL))
#define FM_CAN1_TESTR                             *((volatile uint16_t*)(0x4006300AUL))
#define FM4_CAN1_TESTR                            *((volatile uint16_t*)(0x4006300AUL))
#define FM_CAN1_BRPER                             *((volatile uint16_t*)(0x4006300CUL))
#define FM4_CAN1_BRPER                            *((volatile uint16_t*)(0x4006300CUL))
#define FM_CAN1_IF1CREQ                           *((volatile uint16_t*)(0x40063010UL))
#define FM4_CAN1_IF1CREQ                          *((volatile uint16_t*)(0x40063010UL))
#define FM_CAN1_IF1CMSK                           *((volatile uint16_t*)(0x40063012UL))
#define FM4_CAN1_IF1CMSK                          *((volatile uint16_t*)(0x40063012UL))
#define FM_CAN1_IF1MSK                            *((volatile uint32_t*)(0x40063014UL))
#define FM4_CAN1_IF1MSK                           *((volatile uint32_t*)(0x40063014UL))
#define FM_CAN1_IF1ARB                            *((volatile uint32_t*)(0x40063018UL))
#define FM4_CAN1_IF1ARB                           *((volatile uint32_t*)(0x40063018UL))
#define FM_CAN1_IF1MCTR                           *((volatile uint16_t*)(0x4006301CUL))
#define FM4_CAN1_IF1MCTR                          *((volatile uint16_t*)(0x4006301CUL))
#define FM_CAN1_IF1DTA_L                          *((volatile uint32_t*)(0x40063020UL))
#define FM4_CAN1_IF1DTA_L                         *((volatile uint32_t*)(0x40063020UL))
#define FM_CAN1_IF1DTB_L                          *((volatile uint32_t*)(0x40063024UL))
#define FM4_CAN1_IF1DTB_L                         *((volatile uint32_t*)(0x40063024UL))
#define FM_CAN1_IF1DTA_B                          *((volatile uint32_t*)(0x40063030UL))
#define FM4_CAN1_IF1DTA_B                         *((volatile uint32_t*)(0x40063030UL))
#define FM_CAN1_IF1DTB_B                          *((volatile uint32_t*)(0x40063034UL))
#define FM4_CAN1_IF1DTB_B                         *((volatile uint32_t*)(0x40063034UL))
#define FM_CAN1_IF2CREQ                           *((volatile uint16_t*)(0x40063040UL))
#define FM4_CAN1_IF2CREQ                          *((volatile uint16_t*)(0x40063040UL))
#define FM_CAN1_IF2CMSK                           *((volatile uint16_t*)(0x40063042UL))
#define FM4_CAN1_IF2CMSK                          *((volatile uint16_t*)(0x40063042UL))
#define FM_CAN1_IF2MSK                            *((volatile uint32_t*)(0x40063044UL))
#define FM4_CAN1_IF2MSK                           *((volatile uint32_t*)(0x40063044UL))
#define FM_CAN1_IF2ARB                            *((volatile uint32_t*)(0x40063048UL))
#define FM4_CAN1_IF2ARB                           *((volatile uint32_t*)(0x40063048UL))
#define FM_CAN1_IF2MCTR                           *((volatile uint16_t*)(0x4006304CUL))
#define FM4_CAN1_IF2MCTR                          *((volatile uint16_t*)(0x4006304CUL))
#define FM_CAN1_IF2DTA_L                          *((volatile uint32_t*)(0x40063050UL))
#define FM4_CAN1_IF2DTA_L                         *((volatile uint32_t*)(0x40063050UL))
#define FM_CAN1_IF2DTB_L                          *((volatile uint32_t*)(0x40063054UL))
#define FM4_CAN1_IF2DTB_L                         *((volatile uint32_t*)(0x40063054UL))
#define FM_CAN1_IF2DTA_B                          *((volatile uint32_t*)(0x40063060UL))
#define FM4_CAN1_IF2DTA_B                         *((volatile uint32_t*)(0x40063060UL))
#define FM_CAN1_IF2DTB_B                          *((volatile uint32_t*)(0x40063064UL))
#define FM4_CAN1_IF2DTB_B                         *((volatile uint32_t*)(0x40063064UL))
#define FM_CAN1_TREQR                             *((volatile uint32_t*)(0x40063080UL))
#define FM4_CAN1_TREQR                            *((volatile uint32_t*)(0x40063080UL))
#define FM_CAN1_NEWDT                             *((volatile uint32_t*)(0x40063090UL))
#define FM4_CAN1_NEWDT                            *((volatile uint32_t*)(0x40063090UL))
#define FM_CAN1_INTPND                            *((volatile uint32_t*)(0x400630A0UL))
#define FM4_CAN1_INTPND                           *((volatile uint32_t*)(0x400630A0UL))
#define FM_CAN1_MSGVAL                            *((volatile uint32_t*)(0x400630B0UL))
#define FM4_CAN1_MSGVAL                           *((volatile uint32_t*)(0x400630B0UL))

/*******************************************************************************
* CANPRES Registers CANPRES
*   Register Definition
*******************************************************************************/
#define FM_CANPRES_CANPRE                         *((volatile  uint8_t*)(0x40037000UL))
#define FM4_CANPRES_CANPRE                        *((volatile  uint8_t*)(0x40037000UL))

/*******************************************************************************
* CLK_GATING Registers CLK_GATING
*   Register Definition
*******************************************************************************/
#define FM_CLK_GATING_CKEN0                       *((volatile uint32_t*)(0x4003C100UL))
#define FM4_CLK_GATING_CKEN0                      *((volatile uint32_t*)(0x4003C100UL))
#define FM_CLK_GATING_MRST0                       *((volatile uint32_t*)(0x4003C104UL))
#define FM4_CLK_GATING_MRST0                      *((volatile uint32_t*)(0x4003C104UL))
#define FM_CLK_GATING_CKEN1                       *((volatile uint32_t*)(0x4003C110UL))
#define FM4_CLK_GATING_CKEN1                      *((volatile uint32_t*)(0x4003C110UL))
#define FM_CLK_GATING_MRST1                       *((volatile uint32_t*)(0x4003C114UL))
#define FM4_CLK_GATING_MRST1                      *((volatile uint32_t*)(0x4003C114UL))
#define FM_CLK_GATING_CKEN2                       *((volatile uint32_t*)(0x4003C120UL))
#define FM4_CLK_GATING_CKEN2                      *((volatile uint32_t*)(0x4003C120UL))
#define FM_CLK_GATING_MRST2                       *((volatile uint32_t*)(0x4003C124UL))
#define FM4_CLK_GATING_MRST2                      *((volatile uint32_t*)(0x4003C124UL))

